  const carousel = new SwipeCarousel({
    containerID: '#carousel',
    interval: 2000
  });
  
  carousel.init();
  
// const carousel = new SwipeCarousel(params: {
//   containerID: '.slider',
//   slideID: '.item',
//   interval: 1000,
//   isPlaying: false
// });

// carousel.init();

//планы на эту работу
//1 добавить клавиатурную обработку+
//2 добавить поддержку свайпов для мобильных устройств+
//3 использовать паттерн модуль, чтобы недопустить дублирования переменных+
//4 переписать на прототипы
//5 использоваить наследование для создания pro версии слайдеров
//6 динамическое создание индикаторов
//7 динамическое создание контролсов
//8 базовое конфигурирование объекта
//9 переписать на продвинутые синтаксис - классы
//10 наследование классов
//11 продвинутая конфигурация класса